#pragma		once

// ****************************************************************
// コマンドライン解析構造体
// ================================================================
//		/key = value value ...
// ================================================================
struct S_command_line_analizer_struct
{
	TSTR		key;
	ARRAY<TSTR>	value_list;
};

// ****************************************************************
// コマンドライン解析クラス
// ================================================================
//		コマンドライン（文字列）をトークンに分割します。
//		value でスペースを含む文字列を扱う場合は、"" でくくる必要があります。
//		value が "" でくくられた文字列の場合、￥（円記号）がエスケープ文字になります。
// ================================================================
class C_command_line_analizer
{
public:

	bool	analize_command_line(TSTR str, ARRAY<S_command_line_analizer_struct>& cmd_list);
	TSTR	get_error_str()	{	return erorr_str;	}

private:
	TSTR	erorr_str;
};
