#include "pch.h"

// ****************************************************************
// ローカライズ：日付表記
// ================================================================

TCHAR* MONTH_STR_EN[] = {
	_T("Jan."), _T("Feb."), _T("Mar."), _T("Apr.")
	, _T("May"), _T("Jun."), _T("Jul."), _T("Aug.")
	, _T("Sep."), _T("Oct."), _T("Nov."), _T("Dec.")
};

TCHAR* MONTH_STR_FR[] = {
	_T("Janv."), _T("Fév."), _T("Mars."), _T("Aavril.")
	, _T("Mai."), _T("Juin."), _T("Juill."), _T("Août.")
	, _T("Sept."), _T("Oct."), _T("Nov."), _T("Déc.")
};
