#include	"pch.h"
#include	"data\tnm_sprite.h"

C_tnm_sprite::C_tnm_sprite()
{
}

C_tnm_sprite::~C_tnm_sprite()
{
}

// ****************************************************************
// スプライトの初期化
// ================================================================
void C_tnm_sprite::init()
{
	// 解放
	release();

	// 初期化
	init_no_release();
}

// ****************************************************************
// スプライトの初期化（解放を行わない）
// ================================================================
void C_tnm_sprite::init_no_release()
{
	// パラメータを初期化
	rpex.init();

	// 子供を初期化
	C_d3d_sprite::init_no_release();
}

// ****************************************************************
// スプライトの解放
// ================================================================
void C_tnm_sprite::release()
{
	// 子供を解放
	C_d3d_sprite::release();
}


